In [1]:
import numpy as np
import pandas as pd
string_data = pd.Series(['aardvark', 'artichoke', np.nan,'avocado'])
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [4]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [5]:
string_data.dropna()

0     aardvark
1    artichoke
3      avocado
dtype: object

In [6]:
string_data[string_data.notnull()]

0     aardvark
1    artichoke
3      avocado
dtype: object

In [12]:
from numpy import nan as NA
data = pd.DataFrame([[1., 6.5, 3.,NA], [1., NA, NA],[NA, NA, NA],[NA, 6.5, 3.,NA]])
clean = data.dropna()        #dropna默认丢弃任何含有缺失值的行
data

     0    1    2   3
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [13]:
clean

Empty DataFrame
Columns: [0, 1, 2, 3]
Index: []

In [14]:
data.dropna(how='all') #传入how='all'将只丢弃全为NA的那些行

     0    1    2   3
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [15]:
data.dropna(axis=1,how='all')  #

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [16]:
df = pd.DataFrame(np.random.randn(7,3))
df.iloc[:4,1] = NA                   #.iloc：根据标签的所在位置，从0开始计数，选取列
df.iloc[:2,2] = NA                   #loc：根据DataFrame的具体标签选取列
df

          0         1         2
0  2.921324       NaN       NaN
1 -0.294611       NaN       NaN
2 -1.168712       NaN  0.473910
3  0.834097       NaN -0.253563
4  0.794413  0.653067  0.589415
5  0.138704  1.136269 -0.614190
6  0.060319 -1.330070  0.162895

In [17]:
df.dropna()

          0         1         2
4  0.794413  0.653067  0.589415
5  0.138704  1.136269 -0.614190
6  0.060319 -1.330070  0.162895

In [18]:
df.dropna(thresh=2)

          0         1         2
2 -1.168712       NaN  0.473910
3  0.834097       NaN -0.253563
4  0.794413  0.653067  0.589415
5  0.138704  1.136269 -0.614190
6  0.060319 -1.330070  0.162895

### 填充缺失数据  fillna方法

In [19]:
df.fillna(0)

          0         1         2
0  2.921324  0.000000  0.000000
1 -0.294611  0.000000  0.000000
2 -1.168712  0.000000  0.473910
3  0.834097  0.000000 -0.253563
4  0.794413  0.653067  0.589415
5  0.138704  1.136269 -0.614190
6  0.060319 -1.330070  0.162895

In [20]:
df.fillna({1:0.5,2:0})

          0         1         2
0  2.921324  0.500000  0.000000
1 -0.294611  0.500000  0.000000
2 -1.168712  0.500000  0.473910
3  0.834097  0.500000 -0.253563
4  0.794413  0.653067  0.589415
5  0.138704  1.136269 -0.614190
6  0.060319 -1.330070  0.162895

In [21]:
data2 = pd.Series([1., NA, 3.5, NA, 7])
data2.fillna(data2.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

## 数据转换

### 移除重复数据

In [22]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],'k2': [1, 1, 2, 3, 3, 4, 4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [23]:
#duplicated方法返回一个布尔型Series，表示各行是否是重复行（前面出现过的行）
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [24]:
data.drop_duplicates() #drop_duplicates方法，它会返回一个DataFrame，重复的数组会标为False

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [25]:
data['v1'] = range(7)
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [26]:
data.drop_duplicates(['k1','k2'],keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

### 利用函数或映射进行数据转换

In [3]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork','bacon', 'Pastrami', 'corned beef','Bacon', 'pastrami', 'honey ham', 'novalox'],
                     'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5,6]})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8      novalox     6.0

In [28]:
meat_to_animal = {'bacon':'pig','pulled pork':'pig','pastrami':'cow','corned beef':'cow','honey ham':'pig','novalox':'salmon'}

In [11]:
lowercased = data['food'].str.lower()  #str.lower方法，将字母转换为小写
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8        novalox
Name: food, dtype: object

In [29]:
data['animal'] = lowercased.map(meat_to_animal) #map方法可以接受一个函数或含有映射关系的字典型对象
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8      novalox     6.0  salmon

In [17]:
data['food'].map(lambda x: meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

### 替换值

In [30]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [31]:
data.replace(-999,np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [32]:
data.replace([-999,-1000],np.nan) #如果你希望一次性替换多个值，可以传入一个由待替换值组成的列表以及一个替换值

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [33]:
data.replace([-999,-1000],[np.nan,0]) #要让每个值有不同的替换值，可以传递一个替换列表

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

### 重命名轴索引

In [34]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)), index=['Ohio', 'Colorado', 'New York'], columns=['one', 'two', 'three', 'four'])
transform = lambda x:x[:4].upper()
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [35]:
data.index = data.index.map(transform)
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [36]:
#如果想要创建数据集的转换版（而不是修改原始数据），比较实用的方法是rename
data.rename(index=str.title,columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [37]:
data.rename(index={'OHIO': 'INDIANA'},columns={'three': 'peekaboo'})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

In [39]:
#rename可以实现复制DataFrame并对其索引和列标签进行赋值。如果希望就地修改某个数据集，传入inplace=True即可
data.rename(index={'OHIO':'INDIANA'},inplace = True)
data

         one  two  three  four
INDIANA    0    1      2     3
COLO       4    5      6     7
NEW        8    9     10    11

### 离散化和面元(bin)划分

In [40]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]
bins = [18,25,35,60,100]
cats = pd.cut(ages,bins)
cats
#你可以将其看做一组表示面元名称的字符串。它的底层含有一个表示不同分类名称的类型数组，以及一个codes属性中的年龄数据的标签

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [41]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [42]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]]
              closed='right',
              dtype='interval[int64]')

In [44]:
pd.value_counts(cats)

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

In [45]:
#区间闭端可以通过right=False进行修改
pd.cut(ages,[18,26,36,61,100],right=False)

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 12
Categories (4, interval[int64]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

In [46]:
group_names = ['Youth', 'YoungAdult', 'MiddleAged','Senior']
pd.cut(ages,bins,labels=group_names)

[Youth, Youth, Youth, YoungAdult, Youth, ..., YoungAdult, Senior, MiddleAged, MiddleAged, YoungAdult]
Length: 12
Categories (4, object): [Youth < YoungAdult < MiddleAged < Senior]

In [47]:
#如果向cut传入的是面元的数量而不是确切的面元边界，则它会根据数据的最小值和最大值计算等长面元
data1 = np.random.randn(20)
pd.cut(data1,4,precision=2)  #分成4组数据

[(-0.53, 0.7], (-1.76, -0.53], (-0.53, 0.7], (-0.53, 0.7], (0.7, 1.93], ..., (0.7, 1.93], (-1.76, -0.53], (-0.53, 0.7], (-0.53, 0.7], (1.93, 3.16]]
Length: 20
Categories (4, interval[float64]): [(-1.76, -0.53] < (-0.53, 0.7] < (0.7, 1.93] < (1.93, 3.16]]

In [48]:
#qcut由于使用的是样本分位数，因此可以得到大小基本相等的面元
data = np.random.randn(1000)
cats = pd.qcut(data,4)
cats

[(0.0808, 0.711], (-0.666, 0.0808], (-0.666, 0.0808], (0.0808, 0.711], (-0.666, 0.0808], ..., (0.0808, 0.711], (-0.666, 0.0808], (-3.431, -0.666], (-0.666, 0.0808], (-0.666, 0.0808]]
Length: 1000
Categories (4, interval[float64]): [(-3.431, -0.666] < (-0.666, 0.0808] < (0.0808, 0.711] < (0.711, 3.383]]

In [49]:
pd.value_counts(cats)

(0.711, 3.383]      250
(0.0808, 0.711]     250
(-0.666, 0.0808]    250
(-3.431, -0.666]    250
dtype: int64

### 检测和过滤异常值

In [50]:
data = pd.DataFrame(np.random.randn(1000, 4))
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.005239     0.091933     0.029156     0.017042
std       0.994200     0.984645     1.029520     0.984943
min      -3.346498    -2.817360    -3.667462    -4.172337
25%      -0.675415    -0.561961    -0.645850    -0.633194
50%      -0.007123     0.130382     0.018933     0.019772
75%       0.658455     0.759786     0.677486     0.674962
max       3.383764     3.126749     3.399520     3.356542

In [51]:
col = data[2]
col[np.abs(col) > 3]

49    -3.038916
345    3.094507
383   -3.214722
397   -3.049358
431   -3.667462
820    3.399520
821    3.044461
Name: 2, dtype: float64

In [52]:
data[(np.abs(data) > 3).any(1)] #要选出全部含有“超过3或－3的值”的行，你可以在布尔型DataFrame中使用any方法

            0         1         2         3
48  -0.381615  0.713677  0.310296 -3.206553
49  -0.648268 -0.995402 -3.038916 -0.107589
171  0.282807  1.044768  0.491064 -4.172337
315  3.268873 -0.057279  0.578166 -0.650122
316  3.383764 -0.831178  0.105805 -1.958513
345 -0.262331 -0.398432  3.094507 -1.025760
374  0.145751 -2.242952  0.039875 -3.063633
383 -1.820950  0.353093 -3.214722 -0.135348
392  0.152723  0.463662 -0.534130  3.045108
397 -0.742740 -0.756884 -3.049358  1.688729
408  1.264247 -0.868137  0.754961  3.356542
431 -1.085883  0.070312 -3.667462 -0.024248
439 -3.346498  0.548392 -0.538681  0.131942
537  3.056350 -1.281675  0.944294 -0.240428
561  3.125332  1.335672  0.139450  1.011019
573  1.031161  3.126749  0.749841 -0.804946
688  1.759698  3.044450  0.675077 -0.359885
820  0.361354  1.589455  3.399520 -0.148413
821  0.850446  1.608421  3.044461  0.670187
915  0.278688  0.942368 -0.773860 -3.003439

In [54]:
data[np.abs(data) > 3] = np.sign(data) * 3
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.004752     0.091761     0.029588     0.018086
std       0.990448     0.984129     1.024771     0.978482
min      -3.000000    -2.817360    -3.000000    -3.000000
25%      -0.675415    -0.561961    -0.645850    -0.633194
50%      -0.007123     0.130382     0.018933     0.019772
75%       0.658455     0.759786     0.677486     0.674962
max       3.000000     3.000000     3.000000     3.000000

In [55]:
#np.sign 计算正负号：1（正）、0（0）、-1（负）
np.sign(data).head()

     0    1    2    3
0  1.0 -1.0 -1.0 -1.0
1  1.0  1.0 -1.0 -1.0
2 -1.0 -1.0  1.0  1.0
3 -1.0  1.0 -1.0 -1.0
4 -1.0 -1.0 -1.0 -1.0

### 排列和随机采样

In [56]:
df = pd.DataFrame(np.arange(5 * 4).reshape((5,4)))
sampler = np.random.permutation(5) #通过需要排列的轴的长度调用permutation，可产生一个表示新顺序的整数数组 随机重排列
sampler

array([1, 3, 0, 2, 4])

In [57]:
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [58]:
df.take(sampler)

    0   1   2   3
1   4   5   6   7
3  12  13  14  15
0   0   1   2   3
2   8   9  10  11
4  16  17  18  19

In [59]:
df.sample(n=3)

    0   1   2   3
2   8   9  10  11
3  12  13  14  15
1   4   5   6   7

In [60]:
choices = pd.Series([5,6,-1,4,7])
draws = choices.sample(n=10,replace=True) #要通过替换的方式产生样本（允许重复选择），可以传递replace=True到sample
draws

4    7
4    7
4    7
1    6
2   -1
2   -1
1    6
0    5
1    6
1    6
dtype: int64

### 计算指标/哑变量

In [61]:
#如果DataFrame的某一列中含有k个不同的值，则可以派生出一个k列矩阵或DataFrame（其值全为1和0） get_dummies函数
df = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'],'data1': range(6)})
pd.get_dummies(df['key'])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [62]:
df

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [63]:
dummies = pd.get_dummies(df['key'],prefix='key')  #加上一个前缀，以便能够跟其他数据进行合并 prefix参数可以实现该功能
df_and_dummy = df[['data1']].join(dummies)
df_and_dummy

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

### 电影数据

In [65]:
mnames = ['movie_id','title','genres']
#path = open('D:\Jupyter\利用Python进行数据分析2\yjx\Python-\chapter7\data')
movies = pd.read_table('D:\Jupyter\利用Python进行数据分析2\yjx\Python-\chapter7\data\movies.dat',sep='::',header=None,names=mnames)
movies.head()

c:\users\yjx\appdata\local\programs\python\python36\lib\site-packages\ipykernel_launcher.py:3: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.
  This is separate from the ipykernel package so we can avoid doing imports until

   movie_id                               title                        genres
0         1                    Toy Story (1995)   Animation|Children's|Comedy
1         2                      Jumanji (1995)  Adventure|Children's|Fantasy
2         3             Grumpier Old Men (1995)                Comedy|Romance
3         4            Waiting to Exhale (1995)                  Comedy|Drama
4         5  Father of the Bride Part II (1995)                        Comedy

In [66]:
#要为每个genre添加指标变量就需要做一些数据规整操作
all_genres = []
for x in movies.genres:
    all_genres.extend(x.split('|'))
genres = pd.unique(all_genres)
genres

array(['Animation', "Children's", 'Comedy', 'Adventure', 'Fantasy',
       'Romance', 'Drama', 'Action', 'Crime', 'Thriller', 'Horror',
       'Sci-Fi', 'Documentary', 'War', 'Musical', 'Mystery', 'Film-Noir',
       'Western'], dtype=object)

In [67]:
zero_matrix = np.zeros((len(movies),len(genres)))
dummies = pd.DataFrame(zero_matrix,columns=genres)
gen = movies.genres[0]
gen.split('|')

['Animation', "Children's", 'Comedy']

In [68]:
#dummies各行的条目设为1。要这么做，我们使用dummies.columns来计算每个类型的列索引
dummies.columns.get_indexer(gen.split('|'))

array([0, 1, 2], dtype=int64)

In [69]:
for i,gen in enumerate(movies.genres):
    indices = dummies.columns.get_indexer(gen.split('|'))
    dummies.iloc[i,indices] = 1
movies_widic = movies.join(dummies.add_prefix('Genre_'))
movies_widic.iloc[0]
#笔记：对于很大的数据，用这种方式构建多成员指标变量就会变得非常慢。最好使用更低级的函数，将其写入NumPy数组，然后结果包装在DataFrame中

movie_id                                       1
title                           Toy Story (1995)
genres               Animation|Children's|Comedy
Genre_Animation                                1
Genre_Children's                               1
Genre_Comedy                                   1
Genre_Adventure                                0
Genre_Fantasy                                  0
Genre_Romance                                  0
Genre_Drama                                    0
Genre_Action                                   0
Genre_Crime                                    0
Genre_Thriller                                 0
Genre_Horror                                   0
Genre_Sci-Fi                                   0
Genre_Documentary                              0
Genre_War                                      0
Genre_Musical                                  0
Genre_Mystery                                  0
Genre_Film-Noir                                0
Genre_Western                                  0
Name: 0, dtype: object

In [70]:
#一个对统计应用有用的秘诀是：结合get_dummies和诸如cut之类的离散化函数：
np.random.seed(12345)
values = np.random.rand(10)
values

array([0.92961609, 0.31637555, 0.18391881, 0.20456028, 0.56772503,
       0.5955447 , 0.96451452, 0.6531771 , 0.74890664, 0.65356987])

In [71]:
bins = [0, 0.2, 0.4, 0.6, 0.8, 1]
pd.get_dummies(pd.cut(values,bins))

   (0.0, 0.2]  (0.2, 0.4]  (0.4, 0.6]  (0.6, 0.8]  (0.8, 1.0]
0           0           0           0           0           1
1           0           1           0           0           0
2           1           0           0           0           0
3           0           1           0           0           0
4           0           0           1           0           0
5           0           0           1           0           0
6           0           0           0           0           1
7           0           0           0           1           0
8           0           0           0           1           0
9           0           0           0           1           0

### 字符串操作

In [72]:
#以逗号分隔的字符串可以用split拆分成数段
val = 'a,b,  guido'
val.split(',')

['a', 'b', '  guido']

In [73]:
#split常常与strip一起使用，以去除空白符（包括换行符）
pieces = [x.strip() for x in val.split(',')]
pieces

['a', 'b', 'guido']

In [74]:
'::'.join(pieces)

'a::b::guido'

In [75]:
'a' in val

True

In [76]:
val.index(',')

1

In [77]:
val.find(':') #注意find和index的区别：如果找不到字符串，index将会引发一个异常（而不是返回－1）

-1

In [78]:
val.index(':')

ValueError: substring not found

In [79]:
val.count(',')

2

In [80]:
#replace用于将指定模式替换为另一个模式
val.replace(',','::')

'a::b::  guido'

In [81]:
val.replace(',','')

'ab  guido'

### 正则表达式   re 模式匹配、替换以及拆分

In [82]:
import re
text = "foo bar\t baz \tqux"
re.split('\s+',text)

['foo', 'bar', 'baz', 'qux']

In [84]:
regex = re.compile('\s+') #如果打算对许多字符串应用同一条正则表达式，强烈建议通过re.compile创建regex对象。这样将可以节省大量的CPU时间
regex.findall(text)       #如果想避免正则表达式中不需要的转义（\），则可以使用原始字符串字面量如r'C:\x'（也可以编写其等价式'C:\x'）。

[' ', '\t ', ' \t']

In [86]:
#match和search跟findall功能类似。findall返回的是字符串中所有的匹配项，而search则只返回第一个匹配项。match更加严格，它只匹配字符串的首部
text = """Dave dave@google.com
Steve steve@gmail.com
Rob rob@gmail.com
Ryan ryan@yahoo.com
"""
pattern = r'[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}'
regex = re.compile(pattern,flags = re.IGNORECASE)
regex.findall(text)

['dave@google.com', 'steve@gmail.com', 'rob@gmail.com', 'ryan@yahoo.com']

In [87]:
m = regex.search(text)
m

In [88]:
text[m.start():m.end()]

'dave@google.com'

In [90]:
print(regex.match(text))

None

In [91]:
#sub方法可以将匹配到的模式替换为指定字符串，并返回所得到的新字符串
print(regex.sub('REDACTED',text))

Dave REDACTED
Steve REDACTED
Rob REDACTED
Ryan REDACTED

In [92]:
#将各个地址分成3个部分：用户名、域名以及域后缀。要实现此功能，只需将待分段的模式的各部分用圆括号包起来即可
pattern = r'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})'
regex = re.compile(pattern,flags=re.IGNORECASE)  #意思就是忽略大小写
m = regex.match('wesm@bright.net')
m.groups()  #groups方法返回一个由模式各段组成的元组

('wesm', 'bright', 'net')

In [93]:
regex.findall(text)

[('dave', 'google', 'com'),
 ('steve', 'gmail', 'com'),
 ('rob', 'gmail', 'com'),
 ('ryan', 'yahoo', 'com')]

### pandas的矢量化字符串函数

In [94]:
data = {'Dave': 'dave@google.com', 'Steve':'steve@gmail.com','Rob': 'rob@gmail.com', 'Wes': np.nan}
data = pd.Series(data)
data

Dave     dave@google.com
Steve    steve@gmail.com
Rob        rob@gmail.com
Wes                  NaN
dtype: object

In [95]:
data.isnull()

Dave     False
Steve    False
Rob      False
Wes       True
dtype: bool

In [96]:
data.str.contains('gmail') #Series有一些能够跳过NA值的面向数组方法，进行字符串操作。通过Series的str属性即可访问这些方法
#我们可以通过str.contains检查各个电子邮件地址是否含有"gmail"

Dave     False
Steve     True
Rob       True
Wes        NaN
dtype: object

In [97]:
pattern

'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\\.([A-Z]{2,4})'

In [98]:
data.str.findall(pattern,flags=re.IGNORECASE)

Dave     [(dave, google, com)]
Steve    [(steve, gmail, com)]
Rob        [(rob, gmail, com)]
Wes                        NaN
dtype: object

In [99]:
matches = data.str.match(pattern,flags=re.IGNORECASE)
matches

Dave     True
Steve    True
Rob      True
Wes       NaN
dtype: object

In [100]:
matches.str.get(1)

Dave    NaN
Steve   NaN
Rob     NaN
Wes     NaN
dtype: float64

In [101]:
data.str[:5]

Dave     dave@
Steve    steve
Rob      rob@g
Wes        NaN
dtype: object